{
  "_name_or_path": "nvidia/segformer-b4-finetuned-ade-512-512",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 768,
  "depths": [
    3,
    8,
    27,
    3
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    64,
    128,
    320,
    512
  ],
  "id2label": {
    "0": "wall", "1": "ceiling", "2": "floor", "3": "table", 
    "4": "door", "5": "ceiling lamp", "6": "cabinet", 
    "7": "blinds", "8": "curtain", "9": "chair", 
    "10": "storage cabinet", "11": "office chair", "12": "bookshelf",
    "13": "whiteboard", "14": "window", "15": "box", "16": "window frame", 
    "17": "monitor", "18": "shelf", "19": "doorframe", "20": "pipe",
    "21": "heater", "22": "kitchen cabinet", "23": "sofa", "24": "windowsill",
    "25": "bed", "26": "shower wall", "27": "trash can", "28": "book", "29": "plant", 
    "30": "blanket", "31": "tv", "32": "computer tower", "33": "kitchen counter",
    "34": "refrigerator", "35": "jacket", "36": "electrical duct", "37": "sink", "38": "bag",
    "39": "picture", "40": "pillow", "41": "towel", "42": "suitcase", "43": "backpack",
    "44": "crate", "45": "keyboard", "46": "rack", "47": "toilet", "48": "paper", "49": "printer",
    "50": "poster", "51": "painting", "52": "microwave", "53": "board", "54": "shoes", 
    "55": "socket", "56": "bottle", "57": "bucket", "58": "cushion", "59": "basket", 
    "60": "shoe rack", "61": "telephone", "62": "file folder", "63": "cloth", 
    "64": "blind rail", "65": "laptop", "66": "plant pot", "67": "exhaust fan", 
    "68": "cup", "69": "coat hanger", "70": "light switch", "71": "speaker", 
    "72": "table lamp", "73": "air vent", "74": "clothes hanger", "75": "kettle", 
    "76": "smoke detector", "77": "container", "78": "power strip", "79": "slippers", 
    "80": "paper bag", "81": "mouse", "82": "cutting board", "83": "toilet paper", 
    "84": "paper towel", "85": "pot", "86": "clock", "87": "pan", "88": "tap", "89": "jar", 
    "90": "soap dispenser", "91": "binder", "92": "bowl", "93": "tissue box", 
    "94": "whiteboard eraser", "95": "toilet brush", "96": "spray bottle", 
    "97": "headphones", "98": "stapler", "99": "marker", "100": "background"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "wall": "0", "ceiling": "1", "floor": "2", 
    "table": "3", "door": "4", "ceiling lamp": "5", 
    "cabinet": "6", "blinds": "7", "curtain": "8", 
    "chair": "9", "storage cabinet": "10", "office chair": "11", 
    "bookshelf": "12", "whiteboard": "13", "window": "14", "box": "15", 
    "window frame": "16", "monitor": "17", "shelf": "18", "doorframe": "19", 
    "pipe": "20", "heater": "21", "kitchen cabinet": "22", "sofa": "23",
    "windowsill": "24", "bed": "25", "shower wall": "26", "trash can": "27",
    "book": "28", "plant": "29", "blanket": "30", "tv": "31", 
    "computer tower": "32", "kitchen counter": "33", "refrigerator": "34", 
    "jacket": "35", "electrical duct": "36", "sink": "37", "bag": "38", 
    "picture": "39", "pillow": "40", "towel": "41", "suitcase": "42", 
    "backpack": "43", "crate": "44", "keyboard": "45", "rack": "46", 
    "toilet": "47", "paper": "48", "printer": "49", "poster": "50", 
    "painting": "51", "microwave": "52", "board": "53", "shoes": "54", 
    "socket": "55", "bottle": "56", "bucket": "57", "cushion": "58",
    "basket": "59", "shoe rack": "60", "telephone": "61", 
    "file folder": "62", "cloth": "63", "blind rail": "64", 
    "laptop": "65", "plant pot": "66", "exhaust fan": "67", "cup": "68", 
    "coat hanger": "69", "light switch": "70", "speaker": "71", "table lamp": "72",
    "air vent": "73", "clothes hanger": "74", "kettle": "75", "smoke detector": "76", 
    "container": "77", "power strip": "78", "slippers": "79", "paper bag": "80", 
    "mouse": "81", "cutting board": "82", "toilet paper": "83", "paper towel": "84", 
    "pot": "85", "clock": "86", "pan": "87", "tap": "88", "jar": "89", "soap dispenser": "90",
    "binder": "91", "bowl": "92", "tissue box": "93", "whiteboard eraser": "94", 
    "toilet brush": "95", "spray bottle": "96", "headphones": "97", "stapler": "98",
    "marker": "99", "background": "100"
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.49.0"
}
